Repository: artemmmz/telegram-bot-calorie-counter
Catalog: bot/locales/*/LC_MESSAGES/bot.po
Languages: ru

source: yes
ru: да

source: no
ru: нет

source: menu
ru: меню

source: calculate
ru: рассчитать

source: record
ru: записать

source: statistics
ru: статистика

source: records
ru: записи

source: settings
ru: настройки

source: page
ru: страница

source: male
ru: мужчина

source: female
ru: женщина

source: change value
ru: изменить значение

source: mass unit
ru: единица измерения

source: timezone
ru: часовой пояс

source: g
ru: г

source: gram
ru: грамм

source: oz
ru: у

source: ounce
ru: унция

source: empty
ru: пусто

source: error
ru: ошибка

source: recorded
ru: записано

source: Hello! {t}
ru: Привет! {t}

source: <b>MENU</b> - Record(/record) - record your calories by proteins, fats and carbs - Statistics(/stat) - your calorie, protein, fat and carb statistics - Records(/records) - list of your records - Calculate(/calculate) - calculate your calorie, protein, fat and carb limits - Settings(/settings) - settings mass unit, timezone, language and etc.
ru: <b>МЕНЮ</b> - Записать(/record) - записать калории по белкам, жирам и углеводам - Статистика(/stat) - ваша статистика калорий, белков, жиров и углеводов - Рассчитать(/calculate) - расчитать лимит калорий, белков, жиров и углеводов - Записи(/records) - список ваших записей - Настройки(/settings) - настройки единицы измерения, часового пояса и т.д.

source: Your statistics: Protein: {s[protein]}/{l[protein]} {u} Fat: {s[fat]}/{l[fat]} {u} Carb: {s[carb]}/{l[carb]} {u} Calories: {s[calories]}/{l[calories]} kcal
ru: Статистика: Белки: {s[protein]}/{l[protein]} {u} Жиры: {s[fat]}/{l[fat]} {u} Углеводы: {s[carb]}/{l[carb]} {u} Калории: {s[calories]}/{l[calories]} кКал

source: Time: {r[time_str]} Protein: {r[protein]} {unit} Fat: {r[fat]} {unit} Carb: {r[carb]} {unit} Calories: {r[calories]} kcal
ru: Время: {r[time_str]} Белки: {r[protein]} {unit} Жиры: {r[fat]} {unit} Углеводы: {r[carb]} {unit} Калории: {r[calories]} кКал

source: List of records {rt}
ru: Список записей {rt}

source: SETTINGS Mass unit: {s[unit]} Timezone: UTC{s[timezone]} What change?
ru: НАСТРОЙКИ Единица измерения массы: {s[unit]} Часовой пояс: UTC{s[timezone]} Что изменить?

source: Select your mass unit
ru: Выберите свою единицу измерения массы

source: Select your time zone
ru: Выберите часовой пояс

source: Your choices saved Calculate your limits?
ru: Выбор сохранён Расчитать лимиты потребления?

source: Choose what do you want: 1. Weight gain 2. Control of the diet 3. For the weigth loss
ru: Выберите, что Вы хотите: 1. Набрать вес 2. Контролировать диету 3. Сбросить вес

source: Choose your gender
ru: Выберите пол

source: It must be a number
ru: Это должно быть число

source: Input your age
ru: Введите возраст

source: Input your growth(rounded)
ru: Введите рост(округлённый)

source: Input your weight(rounded)
ru: Введите вес(округлённый)

source: Choose your activity coefficient: 1. Minimum physical activity 2. Workout 3 times per week 3. Workout 5 times per week 4. Intensive workout 5 times per week 5. Workout every day 6. Intensive workout every day or 2 times per day 7. Physical activity every day + physical work
ru: Выберите коэффициент активности: 1. Минимум физической активности 2. Тренировки 3 раза в неделю 3. Тренировки 5 раз в неделю 4. Интенсивные тренировки 5 раз в неделю 5. Тренировки каждый день 6. Интенсивные тренировки каждый день или 2 раза в день 7. Физическая активность каждый день + физическая работа

source: Your calorie limit: {result} kcal Your protein limit: {result_limits[0]} g Your fat limit: {result_limits[1]} g Your carb limit: {result_limits[2]} g Write this number to your calorie limit?
ru: Лимит потребления калорий: {result} кКал Лимит потребления белков: {result_limits[0]} g Лимит потребления жиров: {result_limits[1]} g Лимит потребления углеводов: {result_limits[2]} g Записать в лимит потребления?

source: Input the weight of eaten
ru: Введите вес съеденного

source: Input the weight of protein per 100 grams
ru: Введите вес белков на 100 грамм съеденного

source: Input the weight of fat per 100 grams
ru: Введите вес жиров на 100 грамм съеденного

source: Input the weight of carb per 100 grams
ru: Введите вес углеводов на 100 грамм съеденного
